
import 'package:flutter/material.dart';
import 'package:sebha/widgets/azkar_card.dart';

import '../constants.dart';
class asma_allah_elhosna extends StatefulWidget {
  const asma_allah_elhosna({Key? key}) : super(key: key);

  @override
  _asma_allah_elhosnaState createState() => _asma_allah_elhosnaState();
}

class _asma_allah_elhosnaState extends State<asma_allah_elhosna> {
  @override
  Widget build(BuildContext context) {
    return Container(
        color: black,
        child:ListView(
          children: [
            azkar_card("""
            قال تعالى : "وَلِلّهِ الأَسْمَاء الْحُسْنَى فَادْعُوهُ بِهَا وَذَرُواْ الَّذِينَ يُلْحِدُونَ فِي أَسْمَآئِهِ سَيُجْزَوْنَ مَا كَانُواْ يَعْمَلُونَ". [الأعراف - 180]
وقال تعالى : "قُلِ ادْعُوا اللَّهَ أَوِ ادْعُوا الرَّحْمَنَ أَيًّا مَا تَدْعُوا فَلَهُ الْأَسْمَاءُ الْحُسْنَى وَلَا تَجْهَرْ بِصَلَاتِكَ وَلَا تُخَافِتْ بِهَا وَابْتَغِ بَيْنَ ذَلِكَ سَبِيلًا". [الإسراء - 110]
وقال تعالى : "اللَّهُ لَا إِلَهَ إِلَّا هُوَ لَهُ الْأَسْمَاءُ الْحُسْنَى". [طه - 8]
وقال تعالى : "هُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ لَهُ الْأَسْمَاءُ الْحُسْنَى يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ وَهُوَ الْعَزِيزُ الْحَكِيمُ". [الحشر - 24]
الأسماء الحسنى في الحديث

قَالَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : "إِنَّ لِلَّهِ تِسْعَةً وَتِسْعِينَ اسْمًا مِائَةً إِلا وَاحِدًا مَنْ أَحْصَاهَا دَخَلَ الْجَنَّةَ". 
          """, 1, "https://www.youtube.com/watch?v=CwpP22CrSOQ"),
            azkar_card("""
            الله.
الرحمن.
 الرحيم.
 الملك.
 القدوس.
 السلام.
 المؤمن.
 المهيمن.
 العزيز.
 الجبار.
 المتكبر
 الخالق.
 البارئ.
 المصور.
 الغفار.
 القهار.
 الوهاب.
 الرزاق.
 الفتاح.
 العليم.
 القابض.
 الباسط.
 الخافض.
 الرافع.
 المعز.
 المذل.
 السميع.
 البصير.
 الحكم.
 العدل.
 اللطيف.
 الخبير .
 الحليم.
 العظيم.
 الغفور .
 الشكور.
 العلي.
الكبير.
 الحفيظ .
 المقيت.
 الحسيب.
 الجليل.
 الكريم.
 الرقيب.
 المجيب.
 الواسع.
 الحكيم.
 الودود.
 المجيد.
 الباعث.
 الشهيد.
 الحق.
 الوكيل.
 القوي.
 المتين.
 الولي.
 الحميد.
 المحصي.
 المبدئ.
 المعيد.
 المحيي .
 المميت.
 الحي.
 القيوم.
 الواجد.
 الماجد.
 الواحد .
 الأحد.
 الصمد.
 القادر.
 المقتدر.
المقدم.
 المؤخر.
 الأول.
 الآخر.
 الظاهر.
 الباطن.
 الوالي .
 المتعالي.
 البر.
التواب.
 المنتقم.
 العفو.
 الرءوف.
 مالك الملك.
 ذو الجلال والإكرام .
 المقسط.
 الجامع.
الغني.
 المغني.
 المانع.
 الضار.
 النافع.
 النور.
 الهادي.
 البديع.
 الباقي.
 الوارث.
 الرشيد.
 الصبور .
          """, 1, "https://www.youtube.com/watch?v=CwpP22CrSOQ"),


          ],
        )
    );
  }
}
